In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('Admission_Predict.csv')
df.columns = [x.lower().strip() for x in df.columns]
df.head()

,serial no.,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [8]:
admit_mask = df['chance of admit'] >0.8 # True / False values 
admit_mask # result is a Series, since only 1 col is being operated on.

0       True
1      False
2      False
3      False
4      False
       ...
395     True
396     True
397     True
398    False
399     True
Name: chance of admit, Length: 400, dtype: bool

In [10]:
df.where(admit_mask).head(20)

,serial no.,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
0,1.0,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,6.0,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,12.0,327.0,111.0,4.0,4.0,4.5,9.00,1.0,0.84
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
df.where(admit_mask).dropna().head(10) # dropna function - remove NAN data

,serial no.,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
0,1.0,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
5,6.0,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90
11,12.0,327.0,111.0,4.0,4.0,4.5,9.00,1.0,0.84
22,23.0,328.0,116.0,5.0,5.0,5.0,9.50,1.0,0.94
23,24.0,334.0,119.0,5.0,5.0,4.5,9.70,1.0,0.95
24,25.0,336.0,119.0,5.0,4.0,3.5,9.80,1.0,0.97
25,26.0,340.0,120.0,5.0,4.5,4.5,9.60,1.0,0.94
32,33.0,338.0,118.0,4.0,3.0,4.5,9.40,1.0,0.91
33,34.0,340.0,114.0,5.0,4.0,4.0,9.60,1.0,0.90
34,35.0,331.0,112.0,5.0,4.0,5.0,9.80,1.0,0.94

### combine where() and dropna()

In [14]:
df[df['chance of admit'] > 0.7].head()

,serial no.,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
5,6,330,115,5,4.5,3.0,9.34,1,0.90

In [16]:
df['gre score'].head() # single string parameter - project a single col

0    337
1    324
2    316
3    322
4    314
Name: gre score, dtype: int64

In [15]:
df[['gre score', 'toefl score']].head() # list of columns as strings - project many cols

   gre score  toefl score
0        337          118
1        324          107
2        316          104
3        322          110
4        314          103

In [20]:
df[df['gre score']>331].head() # boolean mask

,serial no.,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
23,24,334,119,5,5.0,4.5,9.70,1,0.95
24,25,336,119,5,4.0,3.5,9.80,1,0.97
25,26,340,120,5,4.5,4.5,9.60,1,0.94
32,33,338,118,4,3.0,4.5,9.40,1,0.91

## & operator - If both masks must be True

In [21]:
(df['chance of admit']>0.85) & (df['chance of admit']<0.95)

0       True
1      False
2      False
3      False
4      False
       ...
395    False
396    False
397     True
398    False
399    False
Name: chance of admit, Length: 400, dtype: bool

### MUST ADD PARENTHESEES () ***

In [23]:
df['chance of admit'].gt(0.7) & df['chance of admit'].lt(0.9)

0      False
1       True
2       True
3       True
4      False
       ...
395     True
396     True
397    False
398    False
399    False
Name: chance of admit, Length: 400, dtype: bool

In [25]:
df['chance of admit'].gt(0.7).lt(0.9)

0      False
1      False
2      False
3      False
4       True
       ...
395    False
396    False
397    False
398     True
399    False
Name: chance of admit, Length: 400, dtype: bool